[
    {
        "title": "MongoDB Article",
        "image": "https://picsum.photos/id/8/1980/1280",
        "intro": "Cet article nous aide a tester les requêtes API. C'est le 1er. Il est désormais persistant sur la base mongoDB",
        "content": "<h2>Mise en place de mongoDB en remote</h2><p>Nous avons effectué la mise en place du mongoDB remote. Jusqu'ici le MOC fonctionnait en localhost.</p><p>Les requêtes semblent fonctionner a part les points d'arrêt</p><h2>Mise en place de Docker</h2><p>Nous allons pouvoir tester la mise en page une fois l'application correctement dockée.</p><p>Cet article nous aide a tester les requêtes API. C'est le 1er. Il est désormais persistant sur la base mongoDB</p>",
        "category": "Developpement Back-end"
    },
    {
        "title": "Ajout des clés pour l'émulation WiiU (wud)",
        "image": "https://picsum.photos/id/134/1980/1280",
        "intro": "Après plusieurs essais, ET n'ayant rien trouvé, d’ailleurs même si des sites anglais, espagnole rien... <br>J'ai finalement trouvé comment trouver le title key .WUD d'un jeu et je voulais vous le partagé ici en exclusivité!!",
        "content": "Mais c'est quoi un Title key pour un jeu en format iso wii u ou .WUD??<br>Un code .WUD, est le code du jeu ,chaque jeu à un Title key différent. Et la wii U ou l'émulateur wiiU  CEMU   le reconnait par ce code.<br>Exemple d'un tilte key en forma  .WUD  pour le jeu Mario Kart 8<br>C3F873C4E01EA02817E182898ECEBC74<br>Mais ici, je vais vous montrer pour le jeu The Legend Of Zelda Twilight Princess HD (USA) que j'ai au format Loadliine (ready to play).<br>Pour un jeux en format loadline   .rpx et que vous voudriez avoir le code pour un jeu en .WUD,mais que vous ne trouvé  pour exemple the legend of zelda twilight princess (usa) , qu'on ne  trouve pas sur le site  plus bas<br>Voici ce que vous avez de besoin, (si vous ne trouvez pas sur ce site) ,(mis plus bas) donc vérifiez si il y ait avant de faire ce tutô pour ne pas perdre votre temps, même si c'est pas long à vérifier.<br>Ce site contient beaucoup de Title key au format .wud. Vérifier aussi la région de votre jeu, car des fois la version (pal) y aie mais pas (usa ou NTSC)<br>https://docs.google....aring&sle=true#<br>Donc si il n'y est pas, ce qu'il vous faut<br>-un jeu au format .RPX (Loadliine souvent nommé ready to play sur internet)<br>-Uwizard<br>-La common key wiiu (google est votre ami, je ne le donne pas)<br>ici vous avez le dossier Zelda exemple ouvrez le dossier nommé Code puis ouvrez le fichier app.xml ,sa devrait vous envoyer sur internet, moi c'est sur internet explorer.<br> zelda10.png<br>Vous aurez ceci en l'ouvrant,  alors voici le code qu'il vous faut, c'est le Title Id (souligné en bleue) faite copier avec votre souris (clique gauche, copier )<br>Que vous aurez besoin pour trouvé Title key pour un jeu .WUD<br>zelda110.png<br>Ensuite si vous avez Uwizard si non télécharger le <br>-ouvrez le<br>-Entrez la common key ,(vous la trouverez sur google)Ensuite allez dans paramètre<br>zelda210.png<br>Puis dans Uwizard aller dans downloader u<br>Puis faite coller le title key (0005000E1019E500) que vous avez trouvé tentôt ,dans le logiciel uziard, cochez décrypter.<br>zelda310.png<br>Démarrer le téléchargement et baisser vers le bas , dans la liste, vous trouverez deux clefs. C'est une des deux....je crois que c'est la decrypted title key. Car pour mario kart 8 c'était celle-ci   <br>Et voilà vous avez votre Title.key<br>zelda410.png",
        "category": "jeux-videos"
    }
]